app/controllers/hosts_controller.rb

  def index
    @hosts = Host.where user: @user.id
---
SELECT "hosts".* FROM "hosts" WHERE "hosts"."user_id" = $1  [["user_id", 1]]

  def create
    @host = Host.new(host_params)
    @host.user = @user

    if @host.save
---
INSERT INTO "hosts" ("name", "zipcode", "rate", "animals", "walker", "grooming", "travel", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"